/*
 * @Description: 文字ID中文映射
 * @Author: zy
 * @Date: 2021-02-26 14:50:08
 * @Reference:
 */
const mapping = {
    "ACCOUNT_EXCEPTION": "অ্যাকাউন্টটি অস্বাভাবিক।",
    "SERVER_EXCEPTION": "সার্ভার ত্রুটি।",
    "LOGIN_FAILED": "লগইন ব্যর্থ হয়েছে, অনুগ্রহ করে পরে আবার চেষ্টা করুন।",
    "NET_INVALID_PARAM": "প্যারামিটার ত্রুটি",
    "NET_RECONNECT_FAILED": "নেটওয়ার্ক সংযোগ স্থাপন ব্যর্থ হয়েছে। অনুগ্রহ করে আবার চেষ্টা করুন।",
    "NET_UNSTABLE": "বর্তমানে নেটওয়ার্ক অস্থির। অনুগ্রহ করে পরে আবার চেষ্টা করুন।",
    "NET_UNSTABLE_TO_CHECK": "বর্তমান নেটওয়ার্ক অস্থির। অনুগ্রহ করে আপনার নেটওয়ার্ক অবস্থা পরীক্ষা করুন।",

    "LYSETTING_4": "কপি সফল হয়েছে।",
    "SHARE_APP_CONFIRM": "অনুগ্রহ করে নিশ্চিত করুন আপনি এই অ্যাপটি ইনস্টল করেছেন।",
    "WHEEL_COPY_URL": "শেয়ার লিঙ্ক কপি করা হয়েছে।",
    "WHEEL_IMG_SAVE": "ছবি সেভ করা হয়েছে।",

    'REQUEST_TIMEOUT': "লেভেল কনফিগারেশন পাওয়ার সময় শেষ!",

    GAME_GET_CONFIG_TIME_OUT: "লেভেল কনফিগারেশন পাওয়ার সময় শেষ!",
    GAME_MATCH_TABLE_TIME_OUT: "ম্যাচের সময় শেষ!",
    GAME_JOIN_TIME_OUT: "রুমে প্রবেশের সময় শেষ!",
    GAME_EXIT_TIME_OUT: "রুম থেকে বের হওয়ার সময় শেষ!",


    "GAME_ERROR_1": "ব্যর্থ",
    "GAME_ERROR_2": "টেবিলটি বিদ্যমান নেই!",
    "GAME_ERROR_3": "লগইন পুনরাবৃত্তি",
    "GAME_ERROR_4": "আপনাকে রুম থেকে বের করে দেওয়া হয়েছে!",
    "GAME_ERROR_5": "ত্রুটি!",
    "GAME_ERROR_6": "ইনপুট প্যারামিটার ত্রুটি",
    "GAME_ERROR_7": "UID ত্রুটিপূর্ণ",
    "GAME_ERROR_8": "লিডারবোর্ড টাইপ ত্রুটিপূর্ণ",
    "GAME_ERROR_9": "অবস্থা ত্রুটিপূর্ণ",
    "GAME_ERROR_10": "অনুগ্রহ করে ডুপ্লিকেট বেট রাখবেন না!",
    "GAME_ERROR_11": "আপনার ব্যালেন্স যথেষ্ট নয়!",
    "GAME_ERROR_12": "আপনার ব্যালেন্স সর্বোচ্চ সীমা অতিক্রম করেছে!",
    "GAME_ERROR_13": "টেবিলটি লোকজনে পূর্ণ!",
    "GAME_ERROR_14": "গ্রহণ ব্যর্থ হয়েছে, আইডি ত্রুটিপূর্ণ!",
    "GAME_ERROR_15": "গ্রহণ ব্যর্থ হয়েছে, লেভেল যথেষ্ট নয়!",
    "GAME_ERROR_16": "কার্যকলাপটি খোলা নেই!",
    "GAME_ERROR_17": "চলমান গেম থেকে বের হওয়া যাবে না",
    "GAME_ERROR_18": "শেয়ার পোস্টার পাওয়া যায়নি!",
    "GAME_ERROR_19": "আপনাকে পূর্ববর্তী রুম থেকে সরিয়ে দেওয়া হয়েছে।",
    "GAME_ERROR_20": "ভুল পরিমাণ",
    "GAME_ERROR_21": "আপনি বেট ধরছেন না",
    "GAME_ERROR_22": "আপনার বেট ধরার সময় শেষ",
    "GAME_ERROR_TIP": ' অনুগ্রহ করে আবার চেষ্টা করুন।',
    "CURRENCY_SYMBOL_NUM": "৳%s",
    "NOT_IN_ROOM": "বর্তমান গেমের জন্য কোনো রুম নেই।",
    "DOWNLOAD_GAME_ERROR": "গেম ডাউনলোড করতে ব্যর্থ হয়েছে, অনুগ্রহ করে আবার চেষ্টা করুন।",
    "TOKEN_LOSE": ['অ্যাকাউন্ট লগইনে অস্বাভাবিকতা শনাক্ত করা হয়েছে। আপনার সংযোগ বিচ্ছিন্ন হয়ে গেছে।', 'আপনাকে গেম থেকে লগ আউট করা হয়েছে। অনুগ্রহ করে পুনরায় লগ ইন করার জন্য লবিতে ফিরে যান।'],
    "SERVER_LOSE": ['সার্ভার রক্ষণাবেক্ষণ চলছে, আপনার সংযোগ বিচ্ছিন্ন করা হয়েছে।', 'সার্ভার রক্ষণাবেক্ষণ চলছে। অসুবিধার জন্য আমরা দুঃখিত।'],
    "TIME_LOSE": ['আপনি {0} মিনিট ধরে বেট ধরেননি এবং আপনাকে রুম থেকে সরিয়ে দেওয়া হয়েছেন।', 'সার্ভার থেকে সংযোগ বিচ্ছিন্ন হয়েছে। অনুগ্রহ করে লবিতে ফিরে যান এবং পুনরায় সংযোগ করুন।'],

    "MONTH_1": "জানুয়ারি",
    "MONTH_10": "অক্টোবর",
    "MONTH_11": "নভেম্বর",
    "MONTH_12": "ডিসেম্বর",
    "MONTH_2": "ফেব্রুয়ারি",
    "MONTH_3": "মার্চ",
    "MONTH_4": "এপ্রিল",
    "MONTH_5": "মে",
    "MONTH_6": "জুন",
    "MONTH_7": "জুলাই",
    "MONTH_8": "আগস্ট",
    "MONTH_9": "সেপ্টেম্বর",

    INSUFFICIENT_FUNDS_KB_RESET: "রিসেট",
    INSUFFICIENT_FUNDS_KB_TIP: "পর্যাপ্ত তহবিল নেই। আপনি কি এটি রিসেট করতে চান?",

    "OK": "ঠিক আছে",
    "NO": "না",
}

globalThis["char_bn"] = { ...globalThis['char_bn'], ...mapping }